api/customer/app/Models/UserModel.php

    public function getUserByEmail(string $email)
    {
        return $this->where('email', $email)->first();
---
SELECT *
FROM "users"
WHERE "email" = 'sam@gmail.com'
 LIMIT 1