api/customer/app/Controllers/CustomerPanel/Api.php

    public function contactformsubmit(){

        $contactformModel = new ContactformModel();

        $json = $this->request->getJSON(true);
        $credentials = decrypt_form_data($json);
        if ($credentials === false) {
            return $this->response->setStatusCode(401)->setJSON([
                'status'  => 401,
                'message' => 'Security verification failed. Invalid or corrupted payload.'
            ]);
        }

       $name = $credentials['name'] ?? null;
       $email = $credentials['email'] ?? null;
       $subject = $credentials['subject'] ?? null;
       $message = $credentials['message'] ?? null;

       $formdatainsert= [
        'subject' => $subject,
        'message' => $message,
        'status' => "pending",
        'name' => $name,
        'email' => $email
       ];

       if ($contactformModel->insert($formdatainsert)) {
---
INSERT INTO "contact_forms" ("subject", "message", "status", "name", "email") VALUES ('Test Subject', 'This is for testing purpose', 'pending', 'Sam', 'sam@gmail.com')